# PRACTICAL QUES 7

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data = [["Mudit Chauhan","December","M","III"], ["Seema Chopra","January","F","II"],
        ["Rani Gupta","March","F","I"], ["Aditya Narayan","October","M","I"], 
        ["Sanjeev Sahni","February","M","II"], ["Prakash Kumar","December","M","III"],
        ["Ritu Agarwal", "September","F","I"], ["Akshay Goel", "August", "M","I"], 
        ["Meeta Kulkarni" ,"July ","F", "II"],  ["Preeti Ahuja ","November", "F", "II"], 
        ["Sunil Das Gupta ","April", "M", "III"], ["Sonali Sapre ","January","F","I"],
        ["Rashmi Talwar", "June ","F" ,"III"],  ["Ashish Dubey" ,"May" ,"M", "II"], 
        ["Kiran Sharma", "February","F", "II"], ["Sameer Bansal", "October","M", "I" ]]

In [3]:
stu = pd.DataFrame(data=data, columns=["Name","Birth_Month","Gender","Pass_Division"])

In [4]:
stu.head()

             Name Birth_Month Gender Pass_Division
0   Mudit Chauhan    December      M           III
1    Seema Chopra     January      F            II
2      Rani Gupta       March      F             I
3  Aditya Narayan     October      M             I
4   Sanjeev Sahni    February      M            II

## PART 1

In [5]:
gender = pd.get_dummies(stu['Gender'])
gender.head()

   F  M
0  0  1
1  1  0
2  1  0
3  0  1
4  0  1

In [6]:
#Multi-collinearity
gender = pd.get_dummies(stu['Gender'],drop_first=True)
gender.head()

   M
0  1
1  0
2  0
3  1
4  1

In [7]:
#Multi-collinearity
div = pd.get_dummies(stu['Pass_Division'])
div.head()

   I  II  III
0  0   0    1
1  0   1    0
2  1   0    0
3  1   0    0
4  0   1    0

## PART 2

In [8]:
stu.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           16 non-null     object
 1   Birth_Month    16 non-null     object
 2   Gender         16 non-null     object
 3   Pass_Division  16 non-null     object
dtypes: object(4)
memory usage: 640.0+ bytes

In [10]:
months = ["January", "February", "March", "April", "May", "June", "July", "August", "September", "October",
          "November", "December"]
stu['Birth_Month'] = pd.Categorical(stu['Birth_Month'], categories=months, ordered=True)
stu.sort_values(by='Birth_Month',inplace=True)
stu.head()

             Name Birth_Month Gender Pass_Division
1    Seema Chopra     January      F            II
11  Sonali Sapre      January      F             I
4   Sanjeev Sahni    February      M            II
14   Kiran Sharma    February      F            II
2      Rani Gupta       March      F             I